let renderer = {
	// Сюда запишем все что надо отобразить.
	map: "",

	/**
	 * Отображает игру в консоли.
	 */
	render() {
		// Цикл перебирает все строки, которые надо отобразить.
		for (let row = 0; row < config.rowsCount; row++) {
			// В каждой строке отображаем для каждой колонки (x - клетка, o - игрок).
			for (let col = 0; col < config.colsCount; col++) {
				// Проверяем, если на данной позиции должен быть и игрок, отображаем игрока, если нет - клетку.
				if (player.y === row && player.x === col) {
					this.map += 'o ';
				} else {
					this.map += 'x ';
				}
			}
			// После того как отобразили всю строку делаем переход на следующую строку.
			this.map += '\n';
		}

		// Выводим все что надо отобразить в игре.
		console.log(this.map);
	},

	clear() {
		// Чистим консоль.
		console.clear();
		// Чистим карту.
		this.map = "";
	}
};